import { GameId } from "./game_data";

export const SET_PAIRS: Record<GameId, Record<string, string>> = {
  genshin: {
    // 仲夏の庭
    "雷のような怒り": "雷を鎮める尊者",
    "雷を鎮める尊者": "雷のような怒り",
    // 銘記の谷
    "翠緑の影": "愛される少女",
    "愛される少女": "翠緑の影",
    // 七門鎮螭を記す密宮
    "燃え盛る炎の魔女": "烈火を渡る賢者",
    "烈火を渡る賢者": "燃え盛る炎の魔女",
    // 孤雲凌霄の処
    "悠久の磐岩": "逆飛びの流星",
    "逆飛びの流星": "悠久の磐岩",
    // 華池岩岫
    "旧貴族のしつけ": "血染めの騎士道",
    "血染めの騎士道": "旧貴族のしつけ",
    // 芬徳尼爾の頂
    "氷風を彷徨う勇士": "沈淪の心",
    "沈淪の心": "氷風を彷徨う勇士",
    // 山嶺の劈く処
    "千岩牢固": "蒼白の炎",
    "蒼白の炎": "千岩牢固",
    // 紅葉の庭
    "絶縁の旗印": "追憶のしめ縄",
    "追憶のしめ縄": "絶縁の旗印",
    // 熟眠の庭
    "華館夢醒形骸記": "海染硨磲",
    "海染硨磲": "華館夢醒形骸記",
    // 岩中境
    "辰砂往生録": "来歆の余響",
    "来歆の余響": "辰砂往生録",
    // 縁覚の塔
    "深林の記憶": "金メッキの夢",
    "金メッキの夢": "深林の記憶",
    // 赤金権現の居城
    "砂上の楼閣の史話": "楽園の絶花",
    "楽園の絶花": "砂上の楼閣の史話",
    // 鉄林の孤府
    "水仙の夢": "花海甘露の光",
    "花海甘露の光": "水仙の夢",
    // 罪禍の終末
    "ファントムハンター": "黄金の劇団",
    "黄金の劇団": "ファントムハンター",
    // 滝を臨む廃都
    "残響の森の夜話": "往日の歌",
    "往日の歌": "残響の森の夜話",
    // 色褪せた劇場
    "諧律の奇想曲": "未完成の叙事詩",
    "未完成の叙事詩": "諧律の奇想曲",
    // 虹の霊地 (ナタ)
    "勇気の歌": "黒い黒晶の断章",
    "黒い黒晶の断章": "勇気の歌",
  },
  starrail: {
    "宝命長存の蒔者": "仮想空間を彷徨うメッセンジャー",
    "仮想空間を彷徨うメッセンジャー": "宝命長存の蒔者",
    "死水に潜る先駆者": "時計屋の残骸を追う夢見人",
    "時計屋の残骸を追う夢見人": "死水に潜る先駆者",
    "灰花を燃やす大公": "囚われの身の深牢",
    "機心と戦う風雲児": "蝗害を一掃せし鉄騎",
    "風雲を薙ぎ払う勇烈": "重きを背負う異端者",
  },
  zzz: {
    "ウッドペッカー・エレクトロ": "ソウル・パニッシャー",
    "スイング・ジャズ": "混沌のメタファー",
    "フリーダム・ブルース": "衝撃のショック",
  }
};
