import { GameId } from "./game_data";

export const SET_PAIRS: Record<GameId, Record<string, string>> = {
  genshin: {
    "絶縁の旗印": "追憶のしめ縄",
    "追憶のしめ縄": "絶縁の旗印", // 双方向
    "黄金の劇団": "ファントムハンター",
    "ファントムハンター": "黄金の劇団",
    "深林の記憶": "金メッキの夢",
    "金メッキの夢": "深林の記憶",
    "翠緑の影": "愛される少女",
    "愛される少女": "翠緑の影",
    "氷風を彷徨う勇士": "沈淪の心",
    "沈淪の心": "氷風を彷徨う勇士",
    "悠久の磐岩": "逆飛びの流星",
    "逆飛びの流星": "悠久の磐岩",
    "華館夢醒形骸記": "海染硨磲",
    "海染硨磲": "華館夢醒形骸記",
    "来歆の余響": "辰砂往生録",
    "辰砂往生録": "来歆の余響",
    "砂上の楼閣の史話": "楽園の絶花",
    "楽園の絶花": "砂上の楼閣の史話",
    "水仙の夢": "花海甘露の光",
    "花海甘露の光": "水仙の夢",
    "残響の森の夜話": "往日の歌",
    "往日の歌": "残響の森の夜話",
    "諧律の奇想曲": "未完成の叙事詩",
    "未完成の叙事詩": "諧律の奇想曲",
    "勇気を出して": "灰燼に咲く栄華", // ナタセット
    "灰燼に咲く栄華": "黒い黒晶の断章", // 暫定
  },
  starrail: {
    "宝命長存の蒔者": "仮想空間を彷徨うメッセンジャー",
    "仮想空間を彷徨うメッセンジャー": "宝命長存の蒔者",
    "死水に潜る先駆者": "時計屋の残骸を追う夢見人",
    "時計屋の残骸を追う夢見人": "死水に潜る先駆者",
    "灰花を燃やす大公": "囚われの身の深牢",
    "機心と戦う風雲児": "蝗害を一掃せし鉄騎",
    "鉄騎": "機心と戦う風雲児",
    "風雲を薙ぎ払う勇烈": "重きを背負う異端者",
  },
  zzz: {
    "ウッドペッカー・エレクトロ": "ソウル・パニッシャー",
    "スイング・ジャズ": "混沌のメタファー",
    "フリーダム・ブルース": "衝撃のショック",
  }
};
