import { CharacterData } from './game_data';

export const STARRAIL_CHARACTERS: CharacterData[] = [
  { 
    name: "黄泉", 
    element: "雷", 
    defaults: {
      weights: { "会心率": 1, "会心ダメージ": 1, "攻撃力%": 1, "速度": 0.3 },
      mainStats: { "胴体": "会心ダメージ", "脚部": "攻撃力%", "次元界オーブ": "攻撃力%", "連結縄": "攻撃力%" },
      targetSets: ["死水に潜る先駆者", "出雲顕神と高天原"],
      baseStats: { rate: 5, dmg: 50, atk: 100, hp: 0, def: 0, er: 100, em: 0, scalingMode: "atk" }
    }
  },
  { 
    name: "ホタル", 
    element: "炎", 
    defaults: {
      weights: { "撃破特効": 1, "速度": 1, "攻撃力%": 0.5 },
      mainStats: { "胴体": "攻撃力%", "脚部": "速度", "次元界オーブ": "攻撃力%", "連結縄": "撃破特効" },
      targetSets: ["機心と戦う風雲児", "劫火と蓮灯の鋳煉宮"],
      baseStats: { rate: 5, dmg: 50, atk: 100, hp: 0, def: 0, er: 100, em: 200, scalingMode: "atk" }
    }
  },
  { 
    name: "飛霄", 
    element: "風", 
    defaults: {
      weights: { "会心率": 1, "会心ダメージ": 1, "攻撃力%": 0.8, "速度": 0.8 },
      mainStats: { "胴体": "会心率", "脚部": "速度", "次元界オーブ": "風ダメージ", "連結縄": "攻撃力%" },
      targetSets: ["風雲を薙ぎ払う勇烈", "奔狼の都藍王朝"],
      baseStats: { rate: 5, dmg: 50, atk: 100, hp: 0, def: 0, er: 100, em: 0, scalingMode: "atk" }
    }
  },
  { name: "ブローニャ", element: "風" },
  { name: "ゼーレ", element: "量子" },
  { name: "鏡流", element: "氷" },
  { name: "飲月", element: "虚数" },
  { name: "花火", element: "量子" },
  { name: "アベンチュリン", element: "虚数" },
  { name: "ロビン", element: "物理" },
  { name: "雲璃", element: "物理" },
  { name: "カフカ", element: "雷" },
  { name: "ブラックスワン", element: "風" },
  { name: "ルアン・メェイ", element: "氷" },
  { name: "その他", element: "無" }
];

export const STARRAIL_SETS = [
  "流雲無痕の過客", "草の穂ガンマン", "純庭教会の聖騎士", "雪の密林の狩人",
  "成り上がりチャンピオン", "吹雪と対峙する兵士", "溶岩で鍛造する火匠",
  "星の如く輝く天才", "雷鳴轟くバンド", "昼夜の狭間を翔ける鷹",
  "流星の跡を追う怪盗", "荒地で盗みを働く廃土客", "宝命長存の蒔者",
  "仮想空間を彷徨うメッセンジャー", "灰花を燃やす大公", "死水に潜る先駆者",
  "時計屋の残骸を追う夢見人", "機心と戦う風雲児", "蝗害を一掃せし鉄騎",
  "風雲を薙ぎ払う勇烈", "重きを背負う異端者",
  "宇宙封印ステーション", "老いぬ者の仙舟", "盗賊公国タリア",
  "生命のウェンワーク", "汎銀河商事会社", "天体階差機関",
  "建創者のベロブルグ", "自転が止まったサルソット", "星々の競技場",
  "折れた竜骨", "蒼穹戦線グラモス", "夢の地ピノコニー",
  "荒涼の惑星ツガンニヤ", "顕世の出雲と高天の神国", "奔狼の都藍王朝",
  "劫火と蓮灯の鋳煉宮", "至り尽くせぬバナダイナ", "奇面族の舞装束", "その他"
];

export const STARRAIL_SLOTS = ["頭部", "手部", "胴体", "脚部", "次元界オーブ", "連結縄"];

export const STARRAIL_MAIN_STATS = [
  "HP(固定値)", "攻撃力(固定値)", "HP%", "攻撃力%", "防御力%",
  "会心率", "会心ダメージ", "治癒量", "効果命中", "速度",
  "物理ダメージ", "炎ダメージ", "氷ダメージ", "雷ダメージ", "風ダメージ",
  "量子ダメージ", "虚数ダメージ", "EP回復効率", "撃破特効"
];

export const STARRAIL_SUB_STATS = [
  "会心率", "会心ダメージ", "速度", "攻撃力%", "HP%", "防御力%",
  "効果命中", "効果抵抗", "撃破特効", "攻撃力(固定値)", "HP(固定値)", "防御力(固定値)"
];
